---
type: GroupTypeId
namespace: Autodesk.Revit.DB
version: 2024
members: 123
tags: [revit-api, class]
---

# GroupTypeId

`Autodesk.Revit.DB.GroupTypeId` · Revit 2024 · 123 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | AdskModelProperties | 2024 | `public static ForgeTypeId AdskModelProperties { get ; }` |
| Property | AlternateUnits | 2024 | `public static ForgeTypeId AlternateUnits { get ; }` |
| Property | AnalysisResults | 2024 | `public static ForgeTypeId AnalysisResults { get ; }` |
| Property | AnalyticalAlignment | 2024 | `public static ForgeTypeId AnalyticalAlignment { get ; }` |
| Property | AnalyticalModel | 2024 | `public static ForgeTypeId AnalyticalModel { get ; }` |
| Property | AnalyticalProperties | 2024 | `public static ForgeTypeId AnalyticalProperties { get ; }` |
| Property | Area | 2024 | `public static ForgeTypeId Area { get ; }` |
| Property | ConceptualEnergyData | 2024 | `public static ForgeTypeId ConceptualEnergyData { get ; }` |
| Property | ConceptualEnergyDataBuildingServices | 2024 | `public static ForgeTypeId ConceptualEnergyDataBuildingServices { get ; }` |
| Property | Constraints | 2024 | `public static ForgeTypeId Constraints { get ; }` |
| Property | Construction | 2024 | `public static ForgeTypeId Construction { get ; }` |
| Property | ContinuousrailBeginBottomExtension | 2024 | `public static ForgeTypeId ContinuousrailBeginBottomExtension { get ; }` |
| Property | ContinuousrailEndTopExtension | 2024 | `public static ForgeTypeId ContinuousrailEndTopExtension { get ; }` |
| Property | CouplerArray | 2024 | `public static ForgeTypeId CouplerArray { get ; }` |
| Property | CurtainGrid | 2024 | `public static ForgeTypeId CurtainGrid { get ; }` |
| Property | CurtainGridHoriz | 2024 | `public static ForgeTypeId CurtainGridHoriz { get ; }` |
| Property | CurtainGridU | 2024 | `public static ForgeTypeId CurtainGridU { get ; }` |
| Property | CurtainGridV | 2024 | `public static ForgeTypeId CurtainGridV { get ; }` |
| Property | CurtainGridVert | 2024 | `public static ForgeTypeId CurtainGridVert { get ; }` |
| Property | CurtainGridn1 | 2024 | `public static ForgeTypeId CurtainGridn1 { get ; }` |
| Property | CurtainGridn2 | 2024 | `public static ForgeTypeId CurtainGridn2 { get ; }` |
| Property | CurtainMullionHoriz | 2024 | `public static ForgeTypeId CurtainMullionHoriz { get ; }` |
| Property | CurtainMullionVert | 2024 | `public static ForgeTypeId CurtainMullionVert { get ; }` |
| Property | CurtainMullionn1 | 2024 | `public static ForgeTypeId CurtainMullionn1 { get ; }` |
| Property | CurtainMullionn2 | 2024 | `public static ForgeTypeId CurtainMullionn2 { get ; }` |
| Property | Data | 2024 | `public static ForgeTypeId Data { get ; }` |
| Property | Display | 2024 | `public static ForgeTypeId Display { get ; }` |
| Property | DivisionGeometry | 2024 | `public static ForgeTypeId DivisionGeometry { get ; }` |
| Property | Electrical | 2024 | `public static ForgeTypeId Electrical { get ; }` |
| Property | ElectricalAnalysis | 2024 | `public static ForgeTypeId ElectricalAnalysis { get ; }` |
| Property | ElectricalCircuiting | 2024 | `public static ForgeTypeId ElectricalCircuiting { get ; }` |
| Property | ElectricalEngineering | 2024 | `public static ForgeTypeId ElectricalEngineering { get ; }` |
| Property | ElectricalLighting | 2024 | `public static ForgeTypeId ElectricalLighting { get ; }` |
| Property | ElectricalLoads | 2024 | `public static ForgeTypeId ElectricalLoads { get ; }` |
| Property | EnergyAnalysis | 2024 | `public static ForgeTypeId EnergyAnalysis { get ; }` |
| Property | EnergyAnalysisAdvanced | 2024 | `public static ForgeTypeId EnergyAnalysisAdvanced { get ; }` |
| Property | EnergyAnalysisBldgConsMtlThermalProps | 2024 | `public static ForgeTypeId EnergyAnalysisBldgConsMtlThermalProps { get ; }` |
| Property | EnergyAnalysisBuildingData | 2024 | `public static ForgeTypeId EnergyAnalysisBuildingData { get ; }` |
| Property | EnergyAnalysisConceptualModel | 2024 | `public static ForgeTypeId EnergyAnalysisConceptualModel { get ; }` |
| Property | EnergyAnalysisDetailedAndConceptualModels | 2024 | `public static ForgeTypeId EnergyAnalysisDetailedAndConceptualModels { get ; }` |
| Property | EnergyAnalysisDetailedModel | 2024 | `public static ForgeTypeId EnergyAnalysisDetailedModel { get ; }` |
| Property | EnergyAnalysisRoomSpaceData | 2024 | `public static ForgeTypeId EnergyAnalysisRoomSpaceData { get ; }` |
| Property | FabricationProductData | 2024 | `public static ForgeTypeId FabricationProductData { get ; }` |
| Property | FireProtection | 2024 | `public static ForgeTypeId FireProtection { get ; }` |
| Property | Fitting | 2024 | `public static ForgeTypeId Fitting { get ; }` |
| Property | Flexible | 2024 | `public static ForgeTypeId Flexible { get ; }` |
| Property | Forces | 2024 | `public static ForgeTypeId Forces { get ; }` |
| Property | General | 2024 | `public static ForgeTypeId General { get ; }` |
| Property | GeoLocation | 2024 | `public static ForgeTypeId GeoLocation { get ; }` |
| Property | Geometry | 2024 | `public static ForgeTypeId Geometry { get ; }` |
| Property | GeometryPositioning | 2024 | `public static ForgeTypeId GeometryPositioning { get ; }` |
| Property | Graphics | 2024 | `public static ForgeTypeId Graphics { get ; }` |
| Property | GreenBuilding | 2024 | `public static ForgeTypeId GreenBuilding { get ; }` |
| Property | IdentityData | 2024 | `public static ForgeTypeId IdentityData { get ; }` |
| Property | Ifc | 2024 | `public static ForgeTypeId Ifc { get ; }` |
| Property | Insulation | 2024 | `public static ForgeTypeId Insulation { get ; }` |
| Property | Length | 2024 | `public static ForgeTypeId Length { get ; }` |
| Property | LifeSafety | 2024 | `public static ForgeTypeId LifeSafety { get ; }` |
| Property | LightPhotometrics | 2024 | `public static ForgeTypeId LightPhotometrics { get ; }` |
| Property | Lining | 2024 | `public static ForgeTypeId Lining { get ; }` |
| Property | Materials | 2024 | `public static ForgeTypeId Materials { get ; }` |
| Property | Mechanical | 2024 | `public static ForgeTypeId Mechanical { get ; }` |
| Property | MechanicalAirflow | 2024 | `public static ForgeTypeId MechanicalAirflow { get ; }` |
| Property | MechanicalLoads | 2024 | `public static ForgeTypeId MechanicalLoads { get ; }` |
| Property | Moments | 2024 | `public static ForgeTypeId Moments { get ; }` |
| Property | Nodes | 2024 | `public static ForgeTypeId Nodes { get ; }` |
| Property | OverallLegend | 2024 | `public static ForgeTypeId OverallLegend { get ; }` |
| Property | Pattern | 2024 | `public static ForgeTypeId Pattern { get ; }` |
| Property | PatternApplication | 2024 | `public static ForgeTypeId PatternApplication { get ; }` |
| Property | Phasing | 2024 | `public static ForgeTypeId Phasing { get ; }` |
| Property | Plumbing | 2024 | `public static ForgeTypeId Plumbing { get ; }` |
| Property | PrimaryEnd | 2024 | `public static ForgeTypeId PrimaryEnd { get ; }` |
| Property | PrimaryUnits | 2024 | `public static ForgeTypeId PrimaryUnits { get ; }` |
| Property | Profile | 2024 | `public static ForgeTypeId Profile { get ; }` |
| Property | Profilen1 | 2024 | `public static ForgeTypeId Profilen1 { get ; }` |
| Property | Profilen2 | 2024 | `public static ForgeTypeId Profilen2 { get ; }` |
| Property | RailingSystemFamilyHandrails | 2024 | `public static ForgeTypeId RailingSystemFamilyHandrails { get ; }` |
| Property | RailingSystemFamilySegmentPattern | 2024 | `public static ForgeTypeId RailingSystemFamilySegmentPattern { get ; }` |
| Property | RailingSystemFamilyTopRail | 2024 | `public static ForgeTypeId RailingSystemFamilyTopRail { get ; }` |
| Property | RailingSystemSecondaryFamilyHandrails | 2024 | `public static ForgeTypeId RailingSystemSecondaryFamilyHandrails { get ; }` |
| Property | RailingSystemSegmentPatternRemainder | 2024 | `public static ForgeTypeId RailingSystemSegmentPatternRemainder { get ; }` |
| Property | RailingSystemSegmentPatternRepeat | 2024 | `public static ForgeTypeId RailingSystemSegmentPatternRepeat { get ; }` |
| Property | RailingSystemSegmentPosts | 2024 | `public static ForgeTypeId RailingSystemSegmentPosts { get ; }` |
| Property | RailingSystemSegmentUGrid | 2024 | `public static ForgeTypeId RailingSystemSegmentUGrid { get ; }` |
| Property | RailingSystemSegmentVGrid | 2024 | `public static ForgeTypeId RailingSystemSegmentVGrid { get ; }` |
| Property | RebarArray | 2024 | `public static ForgeTypeId RebarArray { get ; }` |
| Property | RebarSystemLayers | 2024 | `public static ForgeTypeId RebarSystemLayers { get ; }` |
| Property | Reference | 2024 | `public static ForgeTypeId Reference { get ; }` |
| Property | ReleasesMemberForces | 2024 | `public static ForgeTypeId ReleasesMemberForces { get ; }` |
| Property | RotationAbout | 2024 | `public static ForgeTypeId RotationAbout { get ; }` |
| Property | RouteAnalysis | 2024 | `public static ForgeTypeId RouteAnalysis { get ; }` |
| Property | SecondaryEnd | 2024 | `public static ForgeTypeId SecondaryEnd { get ; }` |
| Property | SegmentsFittings | 2024 | `public static ForgeTypeId SegmentsFittings { get ; }` |
| Property | SlabShapeEdit | 2024 | `public static ForgeTypeId SlabShapeEdit { get ; }` |
| Property | SplitProfileDimensions | 2024 | `public static ForgeTypeId SplitProfileDimensions { get ; }` |
| Property | StairRisers | 2024 | `public static ForgeTypeId StairRisers { get ; }` |
| Property | StairStringers | 2024 | `public static ForgeTypeId StairStringers { get ; }` |
| Property | StairTreads | 2024 | `public static ForgeTypeId StairTreads { get ; }` |
| Property | StairsCalculatorRules | 2024 | `public static ForgeTypeId StairsCalculatorRules { get ; }` |
| Property | StairsOpenEndConnection | 2024 | `public static ForgeTypeId StairsOpenEndConnection { get ; }` |
| Property | StairsSupports | 2024 | `public static ForgeTypeId StairsSupports { get ; }` |
| Property | StairsTreadsRisers | 2024 | `public static ForgeTypeId StairsTreadsRisers { get ; }` |
| Property | StairsWinders | 2024 | `public static ForgeTypeId StairsWinders { get ; }` |
| Property | Structural | 2024 | `public static ForgeTypeId Structural { get ; }` |
| Property | StructuralAnalysis | 2024 | `public static ForgeTypeId StructuralAnalysis { get ; }` |
| Property | StructuralSectionDimensions | 2024 | `public static ForgeTypeId StructuralSectionDimensions { get ; }` |
| Property | StructuralSectionGeometry | 2024 | `public static ForgeTypeId StructuralSectionGeometry { get ; }` |
| Property | Support | 2024 | `public static ForgeTypeId Support { get ; }` |
| Property | SystemtypeRisedrop | 2024 | `public static ForgeTypeId SystemtypeRisedrop { get ; }` |
| Property | Termination | 2024 | `public static ForgeTypeId Termination { get ; }` |
| Property | Text | 2024 | `public static ForgeTypeId Text { get ; }` |
| Property | Title | 2024 | `public static ForgeTypeId Title { get ; }` |
| Property | ToposolidSubdivision | 2024 | `public static ForgeTypeId ToposolidSubdivision { get ; }` |
| Property | TranslationIn | 2024 | `public static ForgeTypeId TranslationIn { get ; }` |
| Property | TrussFamilyBottomChord | 2024 | `public static ForgeTypeId TrussFamilyBottomChord { get ; }` |
| Property | TrussFamilyDiagWeb | 2024 | `public static ForgeTypeId TrussFamilyDiagWeb { get ; }` |
| Property | TrussFamilyTopChord | 2024 | `public static ForgeTypeId TrussFamilyTopChord { get ; }` |
| Property | TrussFamilyVertWeb | 2024 | `public static ForgeTypeId TrussFamilyVertWeb { get ; }` |
| Property | Underlay | 2024 | `public static ForgeTypeId Underlay { get ; }` |
| Property | ViewCamera | 2024 | `public static ForgeTypeId ViewCamera { get ; }` |
| Property | ViewExtents | 2024 | `public static ForgeTypeId ViewExtents { get ; }` |
| Property | Visibility | 2024 | `public static ForgeTypeId Visibility { get ; }` |
| Property | WallCrossSectionDefinition | 2024 | `public static ForgeTypeId WallCrossSectionDefinition { get ; }` |